scenarios/example/script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://www.google.com"
  phases:
    -
      duration: 5
      arrivalRate: 2
  plugins:
## ## Uncomment this section to record tests stats to InfluxDB
##    influxdb:
##      testName: "example-test" # This name must be changed
##      influx:
##        host: "influxdb-host-goes-here"
##        username: "influxdb-username-goes-here"
##        password: "influxdb-password-goes-here"
##        database: "influxdb-database-goes-here"

scenarios:
  -
    flow:
      -
        get:
          url: "/"